In [1]:
import pandas as pd
import numpy as np
import pymysql 
import sqlalchemy

In [2]:
# import the SQLAlchemy libraries
from sqlalchemy import create_engine

# create the connection string to the MySQL database
engine = create_engine('mysql+pymysql://ucfnjma:jucahedagu@dev.spatialdatacapture.org:3306/ucfnjma')

# make the connection to the database
conn = engine.raw_connection()

In [3]:
#test engine
engine

Engine(mysql+pymysql://ucfnjma:***@dev.spatialdatacapture.org:3306/ucfnjma)

In [4]:
#test connection
conn

In [ ]:
########
# To upload a dataframe
#########


#Change fileName with the .csv file you want to read into python
# df = pd.read_csv('Met430k.csv')
# df.replace(r'\s+', np.nan, regex=True)

#Change SQL_Table_Name for the name of your newly created table

# df1 = df.head(1000)

# df.to_sql('Test_Table', engine)

In [5]:
table_names = engine.table_names()
print(table_names)

['Cluster_Table', 'Final_Data', 'METDataClean', 'MET_Final', 'MET_Final2', 'MET_USA_clean_spatial4', 'Met430k', 'MetCountry(clustered)', 'Met_noUSA', 'SpatialMET', 'SpatialMET_test', 'artwork_cities', 'artwork_cities_final', 'cities', 'countries', 'countries_donation', 'countries_for_join', 'countries_years', 'countries_years_good', 'donation_data', 'final_donation', 'materials', 'metadata', 'table_donation', 'table_donation_good', 'worldCities', 'years']

In [6]:
bubble = pd.read_sql("SELECT `region`, `country`, Count(*) AS count_value FROM Final_Data Group by `region`, `country`", con = engine)
print("bubble: ", bubble)

bubble:                   region                 country  count_value
0         North America           United States       113767
1         Latin America                  Mexico         3419
2         Latin America               Guatemala          137
3                Europe          United Kingdom        31654
4                Europe                   Spain         4803
5                Europe             Netherlands        11438
6                Europe                  France        61254
7         North America                  Canada         1350
8                  Asia                   China        16460
9                Europe                   Italy        41026
10                 Asia                   Japan        23263
11               Europe                 Germany        18047
12               Europe          Czech Republic         1584
13               Europe                 Ireland          911
14        Latin America               Venezuela            6
15        North America                 Bermuda            2
16                 Asia                   India         4134
17        Latin America                  Brazil         3178
18               Europe                 Finland          156
19               Europe                  Sweden          502
20               Europe                 Hungary          427
21   Sub Saharan Africa                   Zaire         2378
22               Europe             Switzerland         1473
23        Latin America                Paraguay           11
24                 Asia                    Iran         8698
25                 Asia                  Turkey          983
26        Latin America                    Peru         3519
27        Latin America                Colombia          394
28               Europe                 Austria         2820
29               Europe                  Poland          218
..                  ...                     ...          ...
104       North America               Greenland            4
105  Sub Saharan Africa                 Senegal           75
106              Europe                Bulgaria           11
107              Europe  Bosnia and Herzegovina            5
108                Asia                   Yemen           19
109              Europe                 Albania            3
110                Asia               Sri Lanka            1
111                Asia              Azerbaijan           27
112                Asia              Bangladesh            9
113                Asia                 Lebanon            3
114                Asia                   Nepal           17
115              Europe                 Ukraine            4
116                Asia         Myanmar (Burma)           63
117              Europe                 Croatia           22
118  Sub Saharan Africa              Mozambique            8
119       Latin America                  Guyana           25
120              Europe                 Romania            1
121              Europe                Slovakia            1
122             Pacific                   Malta            1
123  Sub Saharan Africa                 Lesotho            1
124                Asia              Tajikistan            1
125                Asia                Mongolia            8
126  Sub Saharan Africa                  Guinea            3
127                Asia                Cambodia            5
128  Sub Saharan Africa              Mauritania            3
129                Asia                  Bhutan            2
130              Europe               Macedonia            6
131              Europe                Slovenia            1
132       Latin America                  Belize            2
133       Latin America                 Uruguay            1

[134 rows x 3 columns]

In [9]:
bubble_print = pd.read_sql("SELECT `region`, `country`, Count(*) AS count_value FROM Final_Data WHERE `Class_General` = 'Prints' Group by `region`, `country`", con = engine)
print("bubble_print: ", bubble_print)

bubble_print:                  region         country  count_value
0        North America   United States        33280
1               Europe          France        20386
2               Europe  United Kingdom         9394
3                 Asia           Japan         4209
4                 Asia           China          639
5               Europe         Germany         5949
6               Europe           Italy        15100
7                 Asia           India           80
8               Europe     Netherlands         7333
9                 Asia          Israel           14
10              Europe  Czech Republic          997
11              Europe           Spain         1214
12       Latin America          Brazil          990
13              Europe     Switzerland          440
14              Europe          Sweden          206
15              Europe         Austria          927
16           Australia       Australia           29
17       Latin America          Mexico         1183
18       North America          Canada          743
19  Sub Saharan Africa           Zaire          200
20              Europe          Greece           13
21              Europe          Poland           14
22              Europe         Denmark           44
23              Europe         Ireland          168
24              Europe         Hungary           73
25              Europe         Finland            4
26                Asia            Iran            1
27                Asia          Turkey            1

In [7]:
all_data = pd.read_sql("Select * FROM Final_Data LIMIT 10", con = engine)
print(all_data)

   index  Unnamed: 0  Object ID artist_nationality  object_begin_date  \
0      0           0          1           American               1853
1      1           1         12           American               1876
2      2           2         15               None               1665
3      3           3         16               None               1800
4      4           4         17               None               1867
5      5           5         18               None               1860
6      6           6         19               None               1859
7      7           7         20               None               1860
8      8           8         21               None               1859
9      9           9         22               None               1881

   object_end_date                         credit_line        country  \
0             1853  Gift of Heinz L. Stoppelmann, 1979  United States
1             1876  Gift of Heinz L. Stoppelmann, 1979  United States
2             1700     Gift of Mrs. Russell Sage, 1916         Mexico
3             1900     Gift of Mrs. Russell Sage, 1916         Mexico
4             1867     Gift of Mrs. Russell Sage, 1916         Mexico
5             1860     Gift of Mrs. Russell Sage, 1916         Mexico
6             1859     Gift of Mrs. Russell Sage, 1916         Mexico
7             1860     Gift of Mrs. Russell Sage, 1916         Mexico
8             1859     Gift of Mrs. Russell Sage, 1916         Mexico
9             1881     Gift of Mrs. Russell Sage, 1916      Guatemala

  classification            medium    artist_display_name artist_display_bio  \
0          Metal              Gold  James Barton Longacre           American
1          Metal              Gold  James Barton Longacre           American
2         Silver            Silver                   None               None
3          Metal  Bronze or copper         Mexican Artist               None
4          Metal  Bronze or copper         Mexican Artist               None
5          Metal  Bronze or copper         Mexican Artist               None
6          Metal  Bronze or copper                   None               None
7          Metal  Bronze or copper                   None               None
8          Metal  Bronze or copper                   None               None
9         Silver            Silver                   None               None

      culture object_name                                               link  \
0        None        Coin   http://www.metmuseum.org/art/collection/search/1
1        None        Coin  http://www.metmuseum.org/art/collection/search/12
2     Mexican        Coin  http://www.metmuseum.org/art/collection/search/15
3     Mexican        Peso  http://www.metmuseum.org/art/collection/search/16
4     Mexican        Peso  http://www.metmuseum.org/art/collection/search/17
5     Mexican        Peso  http://www.metmuseum.org/art/collection/search/18
6     Mexican        Peso  http://www.metmuseum.org/art/collection/search/19
7     Mexican        Peso  http://www.metmuseum.org/art/collection/search/20
8     Mexican        Peso  http://www.metmuseum.org/art/collection/search/21
9  Guatemalan        Coin  http://www.metmuseum.org/art/collection/search/22

   acq_year Class_General         region
0    1979.0         Metal  North America
1    1979.0         Metal  North America
2    1916.0        Silver  Latin America
3    1916.0         Metal  Latin America
4    1916.0         Metal  Latin America
5    1916.0         Metal  Latin America
6    1916.0         Metal  Latin America
7    1916.0         Metal  Latin America
8    1916.0         Metal  Latin America
9    1916.0        Silver  Latin America

In [ ]:
bubble = pd.read_sql('SELECT `region`, `country`, Count(*) AS count_value FROM Final_Data Group by `region`, `country` ', con = engine)
print(bubble.head(10))

In [ ]:
distinct = pd.read_sql('SELECT DISTINCT `region` FROM Final_Data', con = engine)

In [ ]:
test = pd.read_sql('SELECT * FROM Final_Data LIMIT 2 ', con = engine)
print(test)

In [11]:
# summary
summary = pd.read_sql('SELECT `Class_General`, `object_begin_date`, Count(*) AS count_value FROM Final_Data Group by `Class_General`, `object_begin_date` ', con = engine)
print(summary.head(100))

         Class_General  object_begin_date  count_value
0                Metal               1853            5
1                Metal               1876            3
2               Silver               1665            2
3                Metal               1800          119
4                Metal               1867            8
5                Metal               1860            8
6                Metal               1859            3
7               Silver               1881            4
8               Silver               1878           10
9                Metal               1885            2
10               Metal               1866            1
11               Glass               1876           13
12           Furniture               1847           13
13               Metal               1893            5
14           Furniture               1884            3
15            Ceramics               1782           25
16  Natural substances               1770           10
17               Glass               1830          242
18               Glass               1850          208
19               Metal               1795           29
20               Metal               1750           17
21               Metal               1697            2
22               Metal               1760           11
23               Metal               1700          109
24               Metal               1797           14
25               Metal               1792            4
26               Metal               1803            3
27               Metal               1807           14
28               Metal               1787           19
29               Metal               1777            8
..                 ...                ...          ...
70           Furniture               1872            6
71           Furniture               1797           32
72           Furniture               1852           12
73           Furniture               1794            5
74           Furniture               1765           30
75           Furniture               1901            8
76           Furniture               1865            9
77           Furniture               1897            5
78           Furniture               1820           10
79           Furniture               1867           12
80           Furniture               1877           36
81           Furniture               1911            1
82           Furniture               1857           21
83           Furniture               1801            1
84           Furniture               1807            3
85           Furniture               1832            2
86           Furniture               1870           21
87           Furniture               1888            2
88           Furniture               1890            4
89           Furniture               1868            6
90           Furniture               1859           11
91           Furniture               1838            8
92           Furniture               1791           11
93           Furniture               1810           65
94           Furniture               1830           10
95           Furniture               1887           10
96           Furniture               1899            9
97               Metal               1852            1
98               Metal               1857            5
99               Glass               1923            5

[100 rows x 3 columns]

In [ ]:
# subset
subset = pd.read_sql("SELECT * FROM Final_Data WHERE country = 'United States'", con = engine)
print(subset.head(10))

In [ ]:
timeseries = pd.read_sql("SELECT `country`, `acq_year`, COUNT(*) as count FROM Final_Data WHERE country IS NOT NULL AND acq_year IS NOT NULL GROUP BY country, acq_year ORDER BY country, acq_year", con = engine)
print(timeseries.head(10))

In [ ]:
years = pd.read_sql("SELECT * FROM years", con = engine)
print(years)

In [ ]:
timeseries = pd.read_sql("SELECT `country`, `acq_year`, COUNT(*) as count FROM Final_Data GROUP BY country, acq_year ORDER BY country, acq_year", con = engine)
print(timeseries.head(10))

In [ ]:
table_donation = pd.read_sql("SELECT * FROM table_donation LIMIT 10", con = engine)
print(table_donation)

In [ ]:
donation = pd.read_sql("SELECT * FROM donation_data", con = engine)
print(donation)

In [ ]:
countries_count = pd.read_sql("SELECT COUNT(DISTINCT country) FROM Final_Data", con = engine)
print(countries_count)

In [ ]:
join_test = pd.read_sql("SELECT MIN(acq_year FROM final_data)", con = engine)
print(join_test.head(10))

In [ ]:
table_sizes = pd.read_sql("SELECT table_schema as `Database`, table_name AS `Table`, round(((data_length + index_length) / 1024 / 1024), 2) `Size in MB` FROM information_schema.TABLES ORDER BY (data_length + index_length) DESC", con = engine)

In [ ]:
table_sizes['Size in MB'].sum()